ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/i2s.h
/*
 * Component description for I2S
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_I2S_COMPONENT_H_
#define _SAMD21_I2S_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR I2S                                          */
/* ************************************************************************** */

/* -------- I2S_CTRLA : (I2S Offset: 0x00) (R/W 8) Control A -------- */
#define I2S_CTRLA_RESETVALUE _UINT8_(0x00) /*  (I2S_CTRLA) Control A  Reset Value */

#define I2S_CTRLA_SWRST_Pos _UINT8_(0) /* (I2S_CTRLA) Software Reset Position */
#define I2S_CTRLA_SWRST_Msk (_UINT8_(0x1) << I2S_CTRLA_SWRST_Pos) /* (I2S_CTRLA) Software Reset Mask */
#define I2S_CTRLA_SWRST(value)                                                                                         \
        (I2S_CTRLA_SWRST_Msk &                                                                                         \
         (_UINT8_(value) << I2S_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the I2S_CTRLA register */
#define I2S_CTRLA_ENABLE_Pos _UINT8_(1) /* (I2S_CTRLA) Enable Position */
#define I2S_CTRLA_ENABLE_Msk (_UINT8_(0x1) << I2S_CTRLA_ENABLE_Pos) /* (I2S_CTRLA) Enable Mask */
#define I2S_CTRLA_ENABLE(value)                                                                                        \
        (I2S_CTRLA_ENABLE_Msk &                                                                                        \
         (_UINT8_(value) << I2S_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the I2S_CTRLA register */
#define I2S_CTRLA_CKEN0_Pos _UINT8_(2) /* (I2S_CTRLA) Clock Unit 0 Enable Position */
#define I2S_CTRLA_CKEN0_Msk (_UINT8_(0x1) << I2S_CTRLA_CKEN0_Pos) /* (I2S_CTRLA) Clock Unit 0 Enable Mask */
#define I2S_CTRLA_CKEN0(value)                                                                                         \
        (I2S_CTRLA_CKEN0_Msk &                                                                                         \
         (_UINT8_(value) << I2S_CTRLA_CKEN0_Pos)) /* Assigment of value for CKEN0 in the I2S_CTRLA register */
#define I2S_CTRLA_CKEN1_Pos _UINT8_(3) /* (I2S_CTRLA) Clock Unit 1 Enable Position */
#define I2S_CTRLA_CKEN1_Msk (_UINT8_(0x1) << I2S_CTRLA_CKEN1_Pos) /* (I2S_CTRLA) Clock Unit 1 Enable Mask */
#define I2S_CTRLA_CKEN1(value)                                                                                         \
        (I2S_CTRLA_CKEN1_Msk &                                                                                         \
         (_UINT8_(value) << I2S_CTRLA_CKEN1_Pos)) /* Assigment of value for CKEN1 in the I2S_CTRLA register */
#define I2S_CTRLA_SEREN0_Pos _UINT8_(4) /* (I2S_CTRLA) Serializer 0 Enable Position */
#define I2S_CTRLA_SEREN0_Msk (_UINT8_(0x1) << I2S_CTRLA_SEREN0_Pos) /* (I2S_CTRLA) Serializer 0 Enable Mask */
#define I2S_CTRLA_SEREN0(value)                                                                                        \
        (I2S_CTRLA_SEREN0_Msk &                                                                                        \
         (_UINT8_(value) << I2S_CTRLA_SEREN0_Pos)) /* Assigment of value for SEREN0 in the I2S_CTRLA register */
#define I2S_CTRLA_SEREN1_Pos _UINT8_(5) /* (I2S_CTRLA) Serializer 1 Enable Position */
#define I2S_CTRLA_SEREN1_Msk (_UINT8_(0x1) << I2S_CTRLA_SEREN1_Pos) /* (I2S_CTRLA) Serializer 1 Enable Mask */
#define I2S_CTRLA_SEREN1(value)                                                                                        \
        (I2S_CTRLA_SEREN1_Msk &                                                                                        \
         (_UINT8_(value) << I2S_CTRLA_SEREN1_Pos)) /* Assigment of value for SEREN1 in the I2S_CTRLA register */
#define I2S_CTRLA_Msk _UINT8_(0x3F) /* (I2S_CTRLA) Register Mask  */

#define I2S_CTRLA_CKEN_Pos _UINT8_(2) /* (I2S_CTRLA Position) Clock Unit x Enable */
#define I2S_CTRLA_CKEN_Msk (_UINT8_(0x3) << I2S_CTRLA_CKEN_Pos) /* (I2S_CTRLA Mask) CKEN */
#define I2S_CTRLA_CKEN(value) (I2S_CTRLA_CKEN_Msk & (_UINT8_(value) << I2S_CTRLA_CKEN_Pos))
#define I2S_CTRLA_SEREN_Pos _UINT8_(4) /* (I2S_CTRLA Position) Serializer x Enable */
#define I2S_CTRLA_SEREN_Msk (_UINT8_(0x3) << I2S_CTRLA_SEREN_Pos) /* (I2S_CTRLA Mask) SEREN */
#define I2S_CTRLA_SEREN(value) (I2S_CTRLA_SEREN_Msk & (_UINT8_(value) << I2S_CTRLA_SEREN_Pos))

/* -------- I2S_CLKCTRL : (I2S Offset: 0x04) (R/W 32) Clock Unit n Control -------- */
#define I2S_CLKCTRL_RESETVALUE _UINT32_(0x00) /*  (I2S_CLKCTRL) Clock Unit n Control  Reset Value */

#define I2S_CLKCTRL_SLOTSIZE_Pos _UINT32_(0) /* (I2S_CLKCTRL) Slot Size Position */
#define I2S_CLKCTRL_SLOTSIZE_Msk (_UINT32_(0x3) << I2S_CLKCTRL_SLOTSIZE_Pos) /* (I2S_CLKCTRL) Slot Size Mask */
#define I2S_CLKCTRL_SLOTSIZE(value)                                                                                    \
        (I2S_CLKCTRL_SLOTSIZE_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << I2S_CLKCTRL_SLOTSIZE_Pos)) /* Assigment of value for SLOTSIZE in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_SLOTSIZE_8_Val _UINT32_(0x0) /* (I2S_CLKCTRL) 8-bit Slot for Clock Unit n  */
#define I2S_CLKCTRL_SLOTSIZE_16_Val _UINT32_(0x1) /* (I2S_CLKCTRL) 16-bit Slot for Clock Unit n  */
#define I2S_CLKCTRL_SLOTSIZE_24_Val _UINT32_(0x2) /* (I2S_CLKCTRL) 24-bit Slot for Clock Unit n  */
#define I2S_CLKCTRL_SLOTSIZE_32_Val _UINT32_(0x3) /* (I2S_CLKCTRL) 32-bit Slot for Clock Unit n  */
#define I2S_CLKCTRL_SLOTSIZE_8                                                                                         \
        (                                                                                                              \
                I2S_CLKCTRL_SLOTSIZE_8_Val                                                                             \
                << I2S_CLKCTRL_SLOTSIZE_Pos) /* (I2S_CLKCTRL) 8-bit Slot for Clock Unit n Position  */
#define I2S_CLKCTRL_SLOTSIZE_16                                                                                        \
        (                                                                                                              \
                I2S_CLKCTRL_SLOTSIZE_16_Val                                                                            \
                << I2S_CLKCTRL_SLOTSIZE_Pos) /* (I2S_CLKCTRL) 16-bit Slot for Clock Unit n Position  */
#define I2S_CLKCTRL_SLOTSIZE_24                                                                                        \
        (                                                                                                              \
                I2S_CLKCTRL_SLOTSIZE_24_Val                                                                            \
                << I2S_CLKCTRL_SLOTSIZE_Pos) /* (I2S_CLKCTRL) 24-bit Slot for Clock Unit n Position  */
#define I2S_CLKCTRL_SLOTSIZE_32                                                                                        \
        (                                                                                                              \
                I2S_CLKCTRL_SLOTSIZE_32_Val                                                                            \
                << I2S_CLKCTRL_SLOTSIZE_Pos) /* (I2S_CLKCTRL) 32-bit Slot for Clock Unit n Position  */
#define I2S_CLKCTRL_NBSLOTS_Pos _UINT32_(2) /* (I2S_CLKCTRL) Number of Slots in Frame Position */
#define I2S_CLKCTRL_NBSLOTS_Msk                                                                                        \
        (_UINT32_(0x7) << I2S_CLKCTRL_NBSLOTS_Pos) /* (I2S_CLKCTRL) Number of Slots in Frame Mask */
#define I2S_CLKCTRL_NBSLOTS(value)                                                                                     \
        (I2S_CLKCTRL_NBSLOTS_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << I2S_CLKCTRL_NBSLOTS_Pos)) /* Assigment of value for NBSLOTS in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_FSWIDTH_Pos _UINT32_(5) /* (I2S_CLKCTRL) Frame Sync Width Position */
#define I2S_CLKCTRL_FSWIDTH_Msk (_UINT32_(0x3) << I2S_CLKCTRL_FSWIDTH_Pos) /* (I2S_CLKCTRL) Frame Sync Width Mask */
#define I2S_CLKCTRL_FSWIDTH(value)                                                                                     \
        (I2S_CLKCTRL_FSWIDTH_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << I2S_CLKCTRL_FSWIDTH_Pos)) /* Assigment of value for FSWIDTH in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_FSWIDTH_SLOT_Val                                                                                   \
        _UINT32_(0x0) /* (I2S_CLKCTRL) Frame Sync Pulse is 1 Slot wide (default for I2S protocol)  */
#define I2S_CLKCTRL_FSWIDTH_HALF_Val _UINT32_(0x1) /* (I2S_CLKCTRL) Frame Sync Pulse is half a Frame wide  */
#define I2S_CLKCTRL_FSWIDTH_BIT_Val _UINT32_(0x2) /* (I2S_CLKCTRL) Frame Sync Pulse is 1 Bit wide  */
#define I2S_CLKCTRL_FSWIDTH_BURST_Val                                                                                  \
        _UINT32_(0x3) /* (I2S_CLKCTRL) Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per     \
                         Data sample, only when Data transfer is requested  */
#define I2S_CLKCTRL_FSWIDTH_SLOT                                                                                       \
        (I2S_CLKCTRL_FSWIDTH_SLOT_Val << I2S_CLKCTRL_FSWIDTH_Pos) /* (I2S_CLKCTRL) Frame Sync Pulse is 1 Slot wide     \
                                                                     (default for I2S protocol) Position  */
#define I2S_CLKCTRL_FSWIDTH_HALF                                                                                       \
        (                                                                                                              \
                I2S_CLKCTRL_FSWIDTH_HALF_Val                                                                           \
                << I2S_CLKCTRL_FSWIDTH_Pos) /* (I2S_CLKCTRL) Frame Sync Pulse is half a Frame wide Position  */
#define I2S_CLKCTRL_FSWIDTH_BIT                                                                                        \
        (                                                                                                              \
                I2S_CLKCTRL_FSWIDTH_BIT_Val                                                                            \
                << I2S_CLKCTRL_FSWIDTH_Pos) /* (I2S_CLKCTRL) Frame Sync Pulse is 1 Bit wide Position  */
#define I2S_CLKCTRL_FSWIDTH_BURST                                                                                      \
        (I2S_CLKCTRL_FSWIDTH_BURST_Val                                                                                 \
         << I2S_CLKCTRL_FSWIDTH_Pos) /* (I2S_CLKCTRL) Clock Unit n operates in Burst mode, with a 1-bit wide Frame     \
                                        Sync pulse per Data sample, only when Data transfer is requested Position  */
#define I2S_CLKCTRL_BITDELAY_Pos _UINT32_(7) /* (I2S_CLKCTRL) Data Delay from Frame Sync Position */
#define I2S_CLKCTRL_BITDELAY_Msk                                                                                       \
        (_UINT32_(0x1) << I2S_CLKCTRL_BITDELAY_Pos) /* (I2S_CLKCTRL) Data Delay from Frame Sync Mask */
#define I2S_CLKCTRL_BITDELAY(value)                                                                                    \
        (I2S_CLKCTRL_BITDELAY_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << I2S_CLKCTRL_BITDELAY_Pos)) /* Assigment of value for BITDELAY in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_BITDELAY_LJ_Val _UINT32_(0x0) /* (I2S_CLKCTRL) Left Justified (0 Bit Delay)  */
#define I2S_CLKCTRL_BITDELAY_I2S_Val _UINT32_(0x1) /* (I2S_CLKCTRL) I2S (1 Bit Delay)  */
#define I2S_CLKCTRL_BITDELAY_LJ                                                                                        \
        (                                                                                                              \
                I2S_CLKCTRL_BITDELAY_LJ_Val                                                                            \
                << I2S_CLKCTRL_BITDELAY_Pos) /* (I2S_CLKCTRL) Left Justified (0 Bit Delay) Position  */
#define I2S_CLKCTRL_BITDELAY_I2S                                                                                       \
        (I2S_CLKCTRL_BITDELAY_I2S_Val << I2S_CLKCTRL_BITDELAY_Pos) /* (I2S_CLKCTRL) I2S (1 Bit Delay) Position  */
#define I2S_CLKCTRL_FSSEL_Pos _UINT32_(8) /* (I2S_CLKCTRL) Frame Sync Select Position */
#define I2S_CLKCTRL_FSSEL_Msk (_UINT32_(0x1) << I2S_CLKCTRL_FSSEL_Pos) /* (I2S_CLKCTRL) Frame Sync Select Mask */
#define I2S_CLKCTRL_FSSEL(value)                                                                                       \
        (I2S_CLKCTRL_FSSEL_Msk &                                                                                       \
         (_UINT32_(value) << I2S_CLKCTRL_FSSEL_Pos)) /* Assigment of value for FSSEL in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_FSSEL_SCKDIV_Val                                                                                   \
        _UINT32_(0x0) /* (I2S_CLKCTRL) Divided Serial Clock n is used as Frame Sync n source  */
#define I2S_CLKCTRL_FSSEL_FSPIN_Val _UINT32_(0x1) /* (I2S_CLKCTRL) FSn input pin is used as Frame Sync n source  */
#define I2S_CLKCTRL_FSSEL_SCKDIV                                                                                       \
        (I2S_CLKCTRL_FSSEL_SCKDIV_Val                                                                                  \
         << I2S_CLKCTRL_FSSEL_Pos) /* (I2S_CLKCTRL) Divided Serial Clock n is used as Frame Sync n source Position  */
#define I2S_CLKCTRL_FSSEL_FSPIN                                                                                        \
        (                                                                                                              \
                I2S_CLKCTRL_FSSEL_FSPIN_Val                                                                            \
                << I2S_CLKCTRL_FSSEL_Pos) /* (I2S_CLKCTRL) FSn input pin is used as Frame Sync n source Position  */
#define I2S_CLKCTRL_FSINV_Pos _UINT32_(11) /* (I2S_CLKCTRL) Frame Sync Invert Position */
#define I2S_CLKCTRL_FSINV_Msk (_UINT32_(0x1) << I2S_CLKCTRL_FSINV_Pos) /* (I2S_CLKCTRL) Frame Sync Invert Mask */
#define I2S_CLKCTRL_FSINV(value)                                                                                       \
        (I2S_CLKCTRL_FSINV_Msk &                                                                                       \
         (_UINT32_(value) << I2S_CLKCTRL_FSINV_Pos)) /* Assigment of value for FSINV in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_SCKSEL_Pos _UINT32_(12) /* (I2S_CLKCTRL) Serial Clock Select Position */
#define I2S_CLKCTRL_SCKSEL_Msk (_UINT32_(0x1) << I2S_CLKCTRL_SCKSEL_Pos) /* (I2S_CLKCTRL) Serial Clock Select Mask */
#define I2S_CLKCTRL_SCKSEL(value)                                                                                      \
        (I2S_CLKCTRL_SCKSEL_Msk &                                                                                      \
         (_UINT32_(value) << I2S_CLKCTRL_SCKSEL_Pos)) /* Assigment of value for SCKSEL in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_SCKSEL_MCKDIV_Val                                                                                  \
        _UINT32_(0x0) /* (I2S_CLKCTRL) Divided Master Clock n is used as Serial Clock n source  */
#define I2S_CLKCTRL_SCKSEL_SCKPIN_Val _UINT32_(0x1) /* (I2S_CLKCTRL) SCKn input pin is used as Serial Clock n source   \
                                                     */
#define I2S_CLKCTRL_SCKSEL_MCKDIV                                                                                      \
        (I2S_CLKCTRL_SCKSEL_MCKDIV_Val << I2S_CLKCTRL_SCKSEL_Pos) /* (I2S_CLKCTRL) Divided Master Clock n is used as   \
                                                                     Serial Clock n source Position  */
#define I2S_CLKCTRL_SCKSEL_SCKPIN                                                                                      \
        (I2S_CLKCTRL_SCKSEL_SCKPIN_Val                                                                                 \
         << I2S_CLKCTRL_SCKSEL_Pos) /* (I2S_CLKCTRL) SCKn input pin is used as Serial Clock n source Position  */
#define I2S_CLKCTRL_MCKSEL_Pos _UINT32_(16) /* (I2S_CLKCTRL) Master Clock Select Position */
#define I2S_CLKCTRL_MCKSEL_Msk (_UINT32_(0x1) << I2S_CLKCTRL_MCKSEL_Pos) /* (I2S_CLKCTRL) Master Clock Select Mask */
#define I2S_CLKCTRL_MCKSEL(value)                                                                                      \
        (I2S_CLKCTRL_MCKSEL_Msk &                                                                                      \
         (_UINT32_(value) << I2S_CLKCTRL_MCKSEL_Pos)) /* Assigment of value for MCKSEL in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_MCKSEL_GCLK_Val _UINT32_(0x0) /* (I2S_CLKCTRL) GCLK_I2S_n is used as Master Clock n source  */
#define I2S_CLKCTRL_MCKSEL_MCKPIN_Val _UINT32_(0x1) /* (I2S_CLKCTRL) MCKn input pin is used as Master Clock n source   \
                                                     */
#define I2S_CLKCTRL_MCKSEL_GCLK                                                                                        \
        (                                                                                                              \
                I2S_CLKCTRL_MCKSEL_GCLK_Val                                                                            \
                << I2S_CLKCTRL_MCKSEL_Pos) /* (I2S_CLKCTRL) GCLK_I2S_n is used as Master Clock n source Position  */
#define I2S_CLKCTRL_MCKSEL_MCKPIN                                                                                      \
        (I2S_CLKCTRL_MCKSEL_MCKPIN_Val                                                                                 \
         << I2S_CLKCTRL_MCKSEL_Pos) /* (I2S_CLKCTRL) MCKn input pin is used as Master Clock n source Position  */
#define I2S_CLKCTRL_MCKEN_Pos _UINT32_(18) /* (I2S_CLKCTRL) Master Clock Enable Position */
#define I2S_CLKCTRL_MCKEN_Msk (_UINT32_(0x1) << I2S_CLKCTRL_MCKEN_Pos) /* (I2S_CLKCTRL) Master Clock Enable Mask */
#define I2S_CLKCTRL_MCKEN(value)                                                                                       \
        (I2S_CLKCTRL_MCKEN_Msk &                                                                                       \
         (_UINT32_(value) << I2S_CLKCTRL_MCKEN_Pos)) /* Assigment of value for MCKEN in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_MCKDIV_Pos _UINT32_(19) /* (I2S_CLKCTRL) Master Clock Division Factor Position */
#define I2S_CLKCTRL_MCKDIV_Msk                                                                                         \
        (_UINT32_(0x1F) << I2S_CLKCTRL_MCKDIV_Pos) /* (I2S_CLKCTRL) Master Clock Division Factor Mask */
#define I2S_CLKCTRL_MCKDIV(value)                                                                                      \
        (I2S_CLKCTRL_MCKDIV_Msk &                                                                                      \
         (_UINT32_(value) << I2S_CLKCTRL_MCKDIV_Pos)) /* Assigment of value for MCKDIV in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_MCKOUTDIV_Pos _UINT32_(24) /* (I2S_CLKCTRL) Master Clock Output Division Factor Position */
#define I2S_CLKCTRL_MCKOUTDIV_Msk                                                                                      \
        (_UINT32_(0x1F) << I2S_CLKCTRL_MCKOUTDIV_Pos) /* (I2S_CLKCTRL) Master Clock Output Division Factor Mask */
#define I2S_CLKCTRL_MCKOUTDIV(value)                                                                                   \
        (I2S_CLKCTRL_MCKOUTDIV_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << I2S_CLKCTRL_MCKOUTDIV_Pos)) /* Assigment of value for MCKOUTDIV in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_FSOUTINV_Pos _UINT32_(29) /* (I2S_CLKCTRL) Frame Sync Output Invert Position */
#define I2S_CLKCTRL_FSOUTINV_Msk                                                                                       \
        (_UINT32_(0x1) << I2S_CLKCTRL_FSOUTINV_Pos) /* (I2S_CLKCTRL) Frame Sync Output Invert Mask */
#define I2S_CLKCTRL_FSOUTINV(value)                                                                                    \
        (I2S_CLKCTRL_FSOUTINV_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << I2S_CLKCTRL_FSOUTINV_Pos)) /* Assigment of value for FSOUTINV in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_SCKOUTINV_Pos _UINT32_(30) /* (I2S_CLKCTRL) Serial Clock Output Invert Position */
#define I2S_CLKCTRL_SCKOUTINV_Msk                                                                                      \
        (_UINT32_(0x1) << I2S_CLKCTRL_SCKOUTINV_Pos) /* (I2S_CLKCTRL) Serial Clock Output Invert Mask */
#define I2S_CLKCTRL_SCKOUTINV(value)                                                                                   \
        (I2S_CLKCTRL_SCKOUTINV_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << I2S_CLKCTRL_SCKOUTINV_Pos)) /* Assigment of value for SCKOUTINV in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_MCKOUTINV_Pos _UINT32_(31) /* (I2S_CLKCTRL) Master Clock Output Invert Position */
#define I2S_CLKCTRL_MCKOUTINV_Msk                                                                                      \
