ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/i2s.h
        (_UINT32_(0x1) << I2S_CLKCTRL_MCKOUTINV_Pos) /* (I2S_CLKCTRL) Master Clock Output Invert Mask */
#define I2S_CLKCTRL_MCKOUTINV(value)                                                                                   \
        (I2S_CLKCTRL_MCKOUTINV_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << I2S_CLKCTRL_MCKOUTINV_Pos)) /* Assigment of value for MCKOUTINV in the I2S_CLKCTRL register */
#define I2S_CLKCTRL_Msk _UINT32_(0xFFFD19FF) /* (I2S_CLKCTRL) Register Mask  */


/* -------- I2S_INTENCLR : (I2S Offset: 0x0C) (R/W 16) Interrupt Enable Clear -------- */
#define I2S_INTENCLR_RESETVALUE _UINT16_(0x00) /*  (I2S_INTENCLR) Interrupt Enable Clear  Reset Value */

#define I2S_INTENCLR_RXRDY0_Pos _UINT16_(0) /* (I2S_INTENCLR) Receive Ready 0 Interrupt Enable Position */
#define I2S_INTENCLR_RXRDY0_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_INTENCLR_RXRDY0_Pos) /* (I2S_INTENCLR) Receive Ready 0 Interrupt Enable Mask */
#define I2S_INTENCLR_RXRDY0(value)                                                                                     \
        (I2S_INTENCLR_RXRDY0_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_INTENCLR_RXRDY0_Pos)) /* Assigment of value for RXRDY0 in the I2S_INTENCLR register */
#define I2S_INTENCLR_RXRDY1_Pos _UINT16_(1) /* (I2S_INTENCLR) Receive Ready 1 Interrupt Enable Position */
#define I2S_INTENCLR_RXRDY1_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_INTENCLR_RXRDY1_Pos) /* (I2S_INTENCLR) Receive Ready 1 Interrupt Enable Mask */
#define I2S_INTENCLR_RXRDY1(value)                                                                                     \
        (I2S_INTENCLR_RXRDY1_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_INTENCLR_RXRDY1_Pos)) /* Assigment of value for RXRDY1 in the I2S_INTENCLR register */
#define I2S_INTENCLR_RXOR0_Pos _UINT16_(4) /* (I2S_INTENCLR) Receive Overrun 0 Interrupt Enable Position */
#define I2S_INTENCLR_RXOR0_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_INTENCLR_RXOR0_Pos) /* (I2S_INTENCLR) Receive Overrun 0 Interrupt Enable Mask */
#define I2S_INTENCLR_RXOR0(value)                                                                                      \
        (I2S_INTENCLR_RXOR0_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTENCLR_RXOR0_Pos)) /* Assigment of value for RXOR0 in the I2S_INTENCLR register */
#define I2S_INTENCLR_RXOR1_Pos _UINT16_(5) /* (I2S_INTENCLR) Receive Overrun 1 Interrupt Enable Position */
#define I2S_INTENCLR_RXOR1_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_INTENCLR_RXOR1_Pos) /* (I2S_INTENCLR) Receive Overrun 1 Interrupt Enable Mask */
#define I2S_INTENCLR_RXOR1(value)                                                                                      \
        (I2S_INTENCLR_RXOR1_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTENCLR_RXOR1_Pos)) /* Assigment of value for RXOR1 in the I2S_INTENCLR register */
#define I2S_INTENCLR_TXRDY0_Pos _UINT16_(8) /* (I2S_INTENCLR) Transmit Ready 0 Interrupt Enable Position */
#define I2S_INTENCLR_TXRDY0_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_INTENCLR_TXRDY0_Pos) /* (I2S_INTENCLR) Transmit Ready 0 Interrupt Enable Mask */
#define I2S_INTENCLR_TXRDY0(value)                                                                                     \
        (I2S_INTENCLR_TXRDY0_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_INTENCLR_TXRDY0_Pos)) /* Assigment of value for TXRDY0 in the I2S_INTENCLR register */
#define I2S_INTENCLR_TXRDY1_Pos _UINT16_(9) /* (I2S_INTENCLR) Transmit Ready 1 Interrupt Enable Position */
#define I2S_INTENCLR_TXRDY1_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_INTENCLR_TXRDY1_Pos) /* (I2S_INTENCLR) Transmit Ready 1 Interrupt Enable Mask */
#define I2S_INTENCLR_TXRDY1(value)                                                                                     \
        (I2S_INTENCLR_TXRDY1_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_INTENCLR_TXRDY1_Pos)) /* Assigment of value for TXRDY1 in the I2S_INTENCLR register */
#define I2S_INTENCLR_TXUR0_Pos _UINT16_(12) /* (I2S_INTENCLR) Transmit Underrun 0 Interrupt Enable Position */
#define I2S_INTENCLR_TXUR0_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_INTENCLR_TXUR0_Pos) /* (I2S_INTENCLR) Transmit Underrun 0 Interrupt Enable Mask */
#define I2S_INTENCLR_TXUR0(value)                                                                                      \
        (I2S_INTENCLR_TXUR0_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTENCLR_TXUR0_Pos)) /* Assigment of value for TXUR0 in the I2S_INTENCLR register */
#define I2S_INTENCLR_TXUR1_Pos _UINT16_(13) /* (I2S_INTENCLR) Transmit Underrun 1 Interrupt Enable Position */
#define I2S_INTENCLR_TXUR1_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_INTENCLR_TXUR1_Pos) /* (I2S_INTENCLR) Transmit Underrun 1 Interrupt Enable Mask */
#define I2S_INTENCLR_TXUR1(value)                                                                                      \
        (I2S_INTENCLR_TXUR1_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTENCLR_TXUR1_Pos)) /* Assigment of value for TXUR1 in the I2S_INTENCLR register */
#define I2S_INTENCLR_Msk _UINT16_(0x3333) /* (I2S_INTENCLR) Register Mask  */

