ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/i2s.h
#define I2S_INTENCLR_RXRDY_Pos _UINT16_(0) /* (I2S_INTENCLR Position) Receive Ready x Interrupt Enable */
#define I2S_INTENCLR_RXRDY_Msk (_UINT16_(0x3) << I2S_INTENCLR_RXRDY_Pos) /* (I2S_INTENCLR Mask) RXRDY */
#define I2S_INTENCLR_RXRDY(value) (I2S_INTENCLR_RXRDY_Msk & (_UINT16_(value) << I2S_INTENCLR_RXRDY_Pos))
#define I2S_INTENCLR_RXOR_Pos _UINT16_(4) /* (I2S_INTENCLR Position) Receive Overrun x Interrupt Enable */
#define I2S_INTENCLR_RXOR_Msk (_UINT16_(0x3) << I2S_INTENCLR_RXOR_Pos) /* (I2S_INTENCLR Mask) RXOR */
#define I2S_INTENCLR_RXOR(value) (I2S_INTENCLR_RXOR_Msk & (_UINT16_(value) << I2S_INTENCLR_RXOR_Pos))
#define I2S_INTENCLR_TXRDY_Pos _UINT16_(8) /* (I2S_INTENCLR Position) Transmit Ready x Interrupt Enable */
#define I2S_INTENCLR_TXRDY_Msk (_UINT16_(0x3) << I2S_INTENCLR_TXRDY_Pos) /* (I2S_INTENCLR Mask) TXRDY */
#define I2S_INTENCLR_TXRDY(value) (I2S_INTENCLR_TXRDY_Msk & (_UINT16_(value) << I2S_INTENCLR_TXRDY_Pos))
#define I2S_INTENCLR_TXUR_Pos _UINT16_(12) /* (I2S_INTENCLR Position) Transmit Underrun x Interrupt Enable */
#define I2S_INTENCLR_TXUR_Msk (_UINT16_(0x3) << I2S_INTENCLR_TXUR_Pos) /* (I2S_INTENCLR Mask) TXUR */
#define I2S_INTENCLR_TXUR(value) (I2S_INTENCLR_TXUR_Msk & (_UINT16_(value) << I2S_INTENCLR_TXUR_Pos))

/* -------- I2S_INTENSET : (I2S Offset: 0x10) (R/W 16) Interrupt Enable Set -------- */
#define I2S_INTENSET_RESETVALUE _UINT16_(0x00) /*  (I2S_INTENSET) Interrupt Enable Set  Reset Value */

#define I2S_INTENSET_RXRDY0_Pos _UINT16_(0) /* (I2S_INTENSET) Receive Ready 0 Interrupt Enable Position */
#define I2S_INTENSET_RXRDY0_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_INTENSET_RXRDY0_Pos) /* (I2S_INTENSET) Receive Ready 0 Interrupt Enable Mask */
#define I2S_INTENSET_RXRDY0(value)                                                                                     \
        (I2S_INTENSET_RXRDY0_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_INTENSET_RXRDY0_Pos)) /* Assigment of value for RXRDY0 in the I2S_INTENSET register */
#define I2S_INTENSET_RXRDY1_Pos _UINT16_(1) /* (I2S_INTENSET) Receive Ready 1 Interrupt Enable Position */
#define I2S_INTENSET_RXRDY1_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_INTENSET_RXRDY1_Pos) /* (I2S_INTENSET) Receive Ready 1 Interrupt Enable Mask */
#define I2S_INTENSET_RXRDY1(value)                                                                                     \
        (I2S_INTENSET_RXRDY1_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_INTENSET_RXRDY1_Pos)) /* Assigment of value for RXRDY1 in the I2S_INTENSET register */
#define I2S_INTENSET_RXOR0_Pos _UINT16_(4) /* (I2S_INTENSET) Receive Overrun 0 Interrupt Enable Position */
#define I2S_INTENSET_RXOR0_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_INTENSET_RXOR0_Pos) /* (I2S_INTENSET) Receive Overrun 0 Interrupt Enable Mask */
#define I2S_INTENSET_RXOR0(value)                                                                                      \
        (I2S_INTENSET_RXOR0_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTENSET_RXOR0_Pos)) /* Assigment of value for RXOR0 in the I2S_INTENSET register */
#define I2S_INTENSET_RXOR1_Pos _UINT16_(5) /* (I2S_INTENSET) Receive Overrun 1 Interrupt Enable Position */
#define I2S_INTENSET_RXOR1_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_INTENSET_RXOR1_Pos) /* (I2S_INTENSET) Receive Overrun 1 Interrupt Enable Mask */
#define I2S_INTENSET_RXOR1(value)                                                                                      \
        (I2S_INTENSET_RXOR1_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTENSET_RXOR1_Pos)) /* Assigment of value for RXOR1 in the I2S_INTENSET register */
#define I2S_INTENSET_TXRDY0_Pos _UINT16_(8) /* (I2S_INTENSET) Transmit Ready 0 Interrupt Enable Position */
#define I2S_INTENSET_TXRDY0_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_INTENSET_TXRDY0_Pos) /* (I2S_INTENSET) Transmit Ready 0 Interrupt Enable Mask */
#define I2S_INTENSET_TXRDY0(value)                                                                                     \
        (I2S_INTENSET_TXRDY0_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_INTENSET_TXRDY0_Pos)) /* Assigment of value for TXRDY0 in the I2S_INTENSET register */
#define I2S_INTENSET_TXRDY1_Pos _UINT16_(9) /* (I2S_INTENSET) Transmit Ready 1 Interrupt Enable Position */
#define I2S_INTENSET_TXRDY1_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_INTENSET_TXRDY1_Pos) /* (I2S_INTENSET) Transmit Ready 1 Interrupt Enable Mask */
#define I2S_INTENSET_TXRDY1(value)                                                                                     \
        (I2S_INTENSET_TXRDY1_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_INTENSET_TXRDY1_Pos)) /* Assigment of value for TXRDY1 in the I2S_INTENSET register */
#define I2S_INTENSET_TXUR0_Pos _UINT16_(12) /* (I2S_INTENSET) Transmit Underrun 0 Interrupt Enable Position */
#define I2S_INTENSET_TXUR0_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_INTENSET_TXUR0_Pos) /* (I2S_INTENSET) Transmit Underrun 0 Interrupt Enable Mask */
#define I2S_INTENSET_TXUR0(value)                                                                                      \
        (I2S_INTENSET_TXUR0_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTENSET_TXUR0_Pos)) /* Assigment of value for TXUR0 in the I2S_INTENSET register */
#define I2S_INTENSET_TXUR1_Pos _UINT16_(13) /* (I2S_INTENSET) Transmit Underrun 1 Interrupt Enable Position */
#define I2S_INTENSET_TXUR1_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_INTENSET_TXUR1_Pos) /* (I2S_INTENSET) Transmit Underrun 1 Interrupt Enable Mask */
#define I2S_INTENSET_TXUR1(value)                                                                                      \
        (I2S_INTENSET_TXUR1_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTENSET_TXUR1_Pos)) /* Assigment of value for TXUR1 in the I2S_INTENSET register */
#define I2S_INTENSET_Msk _UINT16_(0x3333) /* (I2S_INTENSET) Register Mask  */

#define I2S_INTENSET_RXRDY_Pos _UINT16_(0) /* (I2S_INTENSET Position) Receive Ready x Interrupt Enable */
#define I2S_INTENSET_RXRDY_Msk (_UINT16_(0x3) << I2S_INTENSET_RXRDY_Pos) /* (I2S_INTENSET Mask) RXRDY */
#define I2S_INTENSET_RXRDY(value) (I2S_INTENSET_RXRDY_Msk & (_UINT16_(value) << I2S_INTENSET_RXRDY_Pos))
#define I2S_INTENSET_RXOR_Pos _UINT16_(4) /* (I2S_INTENSET Position) Receive Overrun x Interrupt Enable */
#define I2S_INTENSET_RXOR_Msk (_UINT16_(0x3) << I2S_INTENSET_RXOR_Pos) /* (I2S_INTENSET Mask) RXOR */
#define I2S_INTENSET_RXOR(value) (I2S_INTENSET_RXOR_Msk & (_UINT16_(value) << I2S_INTENSET_RXOR_Pos))
#define I2S_INTENSET_TXRDY_Pos _UINT16_(8) /* (I2S_INTENSET Position) Transmit Ready x Interrupt Enable */
#define I2S_INTENSET_TXRDY_Msk (_UINT16_(0x3) << I2S_INTENSET_TXRDY_Pos) /* (I2S_INTENSET Mask) TXRDY */
#define I2S_INTENSET_TXRDY(value) (I2S_INTENSET_TXRDY_Msk & (_UINT16_(value) << I2S_INTENSET_TXRDY_Pos))
#define I2S_INTENSET_TXUR_Pos _UINT16_(12) /* (I2S_INTENSET Position) Transmit Underrun x Interrupt Enable */
#define I2S_INTENSET_TXUR_Msk (_UINT16_(0x3) << I2S_INTENSET_TXUR_Pos) /* (I2S_INTENSET Mask) TXUR */
#define I2S_INTENSET_TXUR(value) (I2S_INTENSET_TXUR_Msk & (_UINT16_(value) << I2S_INTENSET_TXUR_Pos))

