ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/i2s.h
/* -------- I2S_INTFLAG : (I2S Offset: 0x14) (R/W 16) Interrupt Flag Status and Clear -------- */
#define I2S_INTFLAG_RESETVALUE _UINT16_(0x00) /*  (I2S_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define I2S_INTFLAG_RXRDY0_Pos _UINT16_(0) /* (I2S_INTFLAG) Receive Ready 0 Position */
#define I2S_INTFLAG_RXRDY0_Msk (_UINT16_(0x1) << I2S_INTFLAG_RXRDY0_Pos) /* (I2S_INTFLAG) Receive Ready 0 Mask */
#define I2S_INTFLAG_RXRDY0(value)                                                                                      \
        (I2S_INTFLAG_RXRDY0_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTFLAG_RXRDY0_Pos)) /* Assigment of value for RXRDY0 in the I2S_INTFLAG register */
#define I2S_INTFLAG_RXRDY1_Pos _UINT16_(1) /* (I2S_INTFLAG) Receive Ready 1 Position */
#define I2S_INTFLAG_RXRDY1_Msk (_UINT16_(0x1) << I2S_INTFLAG_RXRDY1_Pos) /* (I2S_INTFLAG) Receive Ready 1 Mask */
#define I2S_INTFLAG_RXRDY1(value)                                                                                      \
        (I2S_INTFLAG_RXRDY1_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTFLAG_RXRDY1_Pos)) /* Assigment of value for RXRDY1 in the I2S_INTFLAG register */
#define I2S_INTFLAG_RXOR0_Pos _UINT16_(4) /* (I2S_INTFLAG) Receive Overrun 0 Position */
#define I2S_INTFLAG_RXOR0_Msk (_UINT16_(0x1) << I2S_INTFLAG_RXOR0_Pos) /* (I2S_INTFLAG) Receive Overrun 0 Mask */
#define I2S_INTFLAG_RXOR0(value)                                                                                       \
        (I2S_INTFLAG_RXOR0_Msk &                                                                                       \
         (_UINT16_(value) << I2S_INTFLAG_RXOR0_Pos)) /* Assigment of value for RXOR0 in the I2S_INTFLAG register */
#define I2S_INTFLAG_RXOR1_Pos _UINT16_(5) /* (I2S_INTFLAG) Receive Overrun 1 Position */
#define I2S_INTFLAG_RXOR1_Msk (_UINT16_(0x1) << I2S_INTFLAG_RXOR1_Pos) /* (I2S_INTFLAG) Receive Overrun 1 Mask */
#define I2S_INTFLAG_RXOR1(value)                                                                                       \
        (I2S_INTFLAG_RXOR1_Msk &                                                                                       \
         (_UINT16_(value) << I2S_INTFLAG_RXOR1_Pos)) /* Assigment of value for RXOR1 in the I2S_INTFLAG register */
#define I2S_INTFLAG_TXRDY0_Pos _UINT16_(8) /* (I2S_INTFLAG) Transmit Ready 0 Position */
#define I2S_INTFLAG_TXRDY0_Msk (_UINT16_(0x1) << I2S_INTFLAG_TXRDY0_Pos) /* (I2S_INTFLAG) Transmit Ready 0 Mask */
#define I2S_INTFLAG_TXRDY0(value)                                                                                      \
        (I2S_INTFLAG_TXRDY0_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTFLAG_TXRDY0_Pos)) /* Assigment of value for TXRDY0 in the I2S_INTFLAG register */
#define I2S_INTFLAG_TXRDY1_Pos _UINT16_(9) /* (I2S_INTFLAG) Transmit Ready 1 Position */
#define I2S_INTFLAG_TXRDY1_Msk (_UINT16_(0x1) << I2S_INTFLAG_TXRDY1_Pos) /* (I2S_INTFLAG) Transmit Ready 1 Mask */
#define I2S_INTFLAG_TXRDY1(value)                                                                                      \
        (I2S_INTFLAG_TXRDY1_Msk &                                                                                      \
         (_UINT16_(value) << I2S_INTFLAG_TXRDY1_Pos)) /* Assigment of value for TXRDY1 in the I2S_INTFLAG register */
#define I2S_INTFLAG_TXUR0_Pos _UINT16_(12) /* (I2S_INTFLAG) Transmit Underrun 0 Position */
#define I2S_INTFLAG_TXUR0_Msk (_UINT16_(0x1) << I2S_INTFLAG_TXUR0_Pos) /* (I2S_INTFLAG) Transmit Underrun 0 Mask */
#define I2S_INTFLAG_TXUR0(value)                                                                                       \
        (I2S_INTFLAG_TXUR0_Msk &                                                                                       \
         (_UINT16_(value) << I2S_INTFLAG_TXUR0_Pos)) /* Assigment of value for TXUR0 in the I2S_INTFLAG register */
#define I2S_INTFLAG_TXUR1_Pos _UINT16_(13) /* (I2S_INTFLAG) Transmit Underrun 1 Position */
#define I2S_INTFLAG_TXUR1_Msk (_UINT16_(0x1) << I2S_INTFLAG_TXUR1_Pos) /* (I2S_INTFLAG) Transmit Underrun 1 Mask */
#define I2S_INTFLAG_TXUR1(value)                                                                                       \
        (I2S_INTFLAG_TXUR1_Msk &                                                                                       \
         (_UINT16_(value) << I2S_INTFLAG_TXUR1_Pos)) /* Assigment of value for TXUR1 in the I2S_INTFLAG register */
#define I2S_INTFLAG_Msk _UINT16_(0x3333) /* (I2S_INTFLAG) Register Mask  */

#define I2S_INTFLAG_RXRDY_Pos _UINT16_(0) /* (I2S_INTFLAG Position) Receive Ready x */
#define I2S_INTFLAG_RXRDY_Msk (_UINT16_(0x3) << I2S_INTFLAG_RXRDY_Pos) /* (I2S_INTFLAG Mask) RXRDY */
#define I2S_INTFLAG_RXRDY(value) (I2S_INTFLAG_RXRDY_Msk & (_UINT16_(value) << I2S_INTFLAG_RXRDY_Pos))
#define I2S_INTFLAG_RXOR_Pos _UINT16_(4) /* (I2S_INTFLAG Position) Receive Overrun x */
#define I2S_INTFLAG_RXOR_Msk (_UINT16_(0x3) << I2S_INTFLAG_RXOR_Pos) /* (I2S_INTFLAG Mask) RXOR */
#define I2S_INTFLAG_RXOR(value) (I2S_INTFLAG_RXOR_Msk & (_UINT16_(value) << I2S_INTFLAG_RXOR_Pos))
#define I2S_INTFLAG_TXRDY_Pos _UINT16_(8) /* (I2S_INTFLAG Position) Transmit Ready x */
#define I2S_INTFLAG_TXRDY_Msk (_UINT16_(0x3) << I2S_INTFLAG_TXRDY_Pos) /* (I2S_INTFLAG Mask) TXRDY */
#define I2S_INTFLAG_TXRDY(value) (I2S_INTFLAG_TXRDY_Msk & (_UINT16_(value) << I2S_INTFLAG_TXRDY_Pos))
#define I2S_INTFLAG_TXUR_Pos _UINT16_(12) /* (I2S_INTFLAG Position) Transmit Underrun x */
#define I2S_INTFLAG_TXUR_Msk (_UINT16_(0x3) << I2S_INTFLAG_TXUR_Pos) /* (I2S_INTFLAG Mask) TXUR */
#define I2S_INTFLAG_TXUR(value) (I2S_INTFLAG_TXUR_Msk & (_UINT16_(value) << I2S_INTFLAG_TXUR_Pos))

/* -------- I2S_SYNCBUSY : (I2S Offset: 0x18) ( R/ 16) Synchronization Status -------- */
#define I2S_SYNCBUSY_RESETVALUE _UINT16_(0x00) /*  (I2S_SYNCBUSY) Synchronization Status  Reset Value */

