ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/i2s.h
#define I2S_SYNCBUSY_SWRST_Pos _UINT16_(0) /* (I2S_SYNCBUSY) Software Reset Synchronization Status Position */
#define I2S_SYNCBUSY_SWRST_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_SYNCBUSY_SWRST_Pos) /* (I2S_SYNCBUSY) Software Reset Synchronization Status Mask */
#define I2S_SYNCBUSY_SWRST(value)                                                                                      \
        (I2S_SYNCBUSY_SWRST_Msk &                                                                                      \
         (_UINT16_(value) << I2S_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the I2S_SYNCBUSY register */
#define I2S_SYNCBUSY_ENABLE_Pos _UINT16_(1) /* (I2S_SYNCBUSY) Enable Synchronization Status Position */
#define I2S_SYNCBUSY_ENABLE_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_SYNCBUSY_ENABLE_Pos) /* (I2S_SYNCBUSY) Enable Synchronization Status Mask */
#define I2S_SYNCBUSY_ENABLE(value)                                                                                     \
        (I2S_SYNCBUSY_ENABLE_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the I2S_SYNCBUSY register */
#define I2S_SYNCBUSY_CKEN0_Pos _UINT16_(2) /* (I2S_SYNCBUSY) Clock Unit 0 Enable Synchronization Status Position */
#define I2S_SYNCBUSY_CKEN0_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_SYNCBUSY_CKEN0_Pos) /* (I2S_SYNCBUSY) Clock Unit 0 Enable Synchronization Status Mask */
#define I2S_SYNCBUSY_CKEN0(value)                                                                                      \
        (I2S_SYNCBUSY_CKEN0_Msk &                                                                                      \
         (_UINT16_(value) << I2S_SYNCBUSY_CKEN0_Pos)) /* Assigment of value for CKEN0 in the I2S_SYNCBUSY register */
#define I2S_SYNCBUSY_CKEN1_Pos _UINT16_(3) /* (I2S_SYNCBUSY) Clock Unit 1 Enable Synchronization Status Position */
#define I2S_SYNCBUSY_CKEN1_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_SYNCBUSY_CKEN1_Pos) /* (I2S_SYNCBUSY) Clock Unit 1 Enable Synchronization Status Mask */
#define I2S_SYNCBUSY_CKEN1(value)                                                                                      \
        (I2S_SYNCBUSY_CKEN1_Msk &                                                                                      \
         (_UINT16_(value) << I2S_SYNCBUSY_CKEN1_Pos)) /* Assigment of value for CKEN1 in the I2S_SYNCBUSY register */
#define I2S_SYNCBUSY_SEREN0_Pos _UINT16_(4) /* (I2S_SYNCBUSY) Serializer 0 Enable Synchronization Status Position */
#define I2S_SYNCBUSY_SEREN0_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_SYNCBUSY_SEREN0_Pos) /* (I2S_SYNCBUSY) Serializer 0 Enable Synchronization Status Mask   \
                                                    */
#define I2S_SYNCBUSY_SEREN0(value)                                                                                     \
        (I2S_SYNCBUSY_SEREN0_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_SYNCBUSY_SEREN0_Pos)) /* Assigment of value for SEREN0 in the I2S_SYNCBUSY register */
#define I2S_SYNCBUSY_SEREN1_Pos _UINT16_(5) /* (I2S_SYNCBUSY) Serializer 1 Enable Synchronization Status Position */
#define I2S_SYNCBUSY_SEREN1_Msk                                                                                        \
        (_UINT16_(0x1) << I2S_SYNCBUSY_SEREN1_Pos) /* (I2S_SYNCBUSY) Serializer 1 Enable Synchronization Status Mask   \
                                                    */
#define I2S_SYNCBUSY_SEREN1(value)                                                                                     \
        (I2S_SYNCBUSY_SEREN1_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << I2S_SYNCBUSY_SEREN1_Pos)) /* Assigment of value for SEREN1 in the I2S_SYNCBUSY register */
#define I2S_SYNCBUSY_DATA0_Pos _UINT16_(8) /* (I2S_SYNCBUSY) Data 0 Synchronization Status Position */
#define I2S_SYNCBUSY_DATA0_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_SYNCBUSY_DATA0_Pos) /* (I2S_SYNCBUSY) Data 0 Synchronization Status Mask */
#define I2S_SYNCBUSY_DATA0(value)                                                                                      \
        (I2S_SYNCBUSY_DATA0_Msk &                                                                                      \
         (_UINT16_(value) << I2S_SYNCBUSY_DATA0_Pos)) /* Assigment of value for DATA0 in the I2S_SYNCBUSY register */
#define I2S_SYNCBUSY_DATA1_Pos _UINT16_(9) /* (I2S_SYNCBUSY) Data 1 Synchronization Status Position */
#define I2S_SYNCBUSY_DATA1_Msk                                                                                         \
        (_UINT16_(0x1) << I2S_SYNCBUSY_DATA1_Pos) /* (I2S_SYNCBUSY) Data 1 Synchronization Status Mask */
#define I2S_SYNCBUSY_DATA1(value)                                                                                      \
        (I2S_SYNCBUSY_DATA1_Msk &                                                                                      \
         (_UINT16_(value) << I2S_SYNCBUSY_DATA1_Pos)) /* Assigment of value for DATA1 in the I2S_SYNCBUSY register */
#define I2S_SYNCBUSY_Msk _UINT16_(0x033F) /* (I2S_SYNCBUSY) Register Mask  */

#define I2S_SYNCBUSY_CKEN_Pos _UINT16_(2) /* (I2S_SYNCBUSY Position) Clock Unit x Enable Synchronization Status */
#define I2S_SYNCBUSY_CKEN_Msk (_UINT16_(0x3) << I2S_SYNCBUSY_CKEN_Pos) /* (I2S_SYNCBUSY Mask) CKEN */
#define I2S_SYNCBUSY_CKEN(value) (I2S_SYNCBUSY_CKEN_Msk & (_UINT16_(value) << I2S_SYNCBUSY_CKEN_Pos))
#define I2S_SYNCBUSY_SEREN_Pos _UINT16_(4) /* (I2S_SYNCBUSY Position) Serializer x Enable Synchronization Status */
#define I2S_SYNCBUSY_SEREN_Msk (_UINT16_(0x3) << I2S_SYNCBUSY_SEREN_Pos) /* (I2S_SYNCBUSY Mask) SEREN */
#define I2S_SYNCBUSY_SEREN(value) (I2S_SYNCBUSY_SEREN_Msk & (_UINT16_(value) << I2S_SYNCBUSY_SEREN_Pos))
#define I2S_SYNCBUSY_DATA_Pos _UINT16_(8) /* (I2S_SYNCBUSY Position) Data x Synchronization Status */
#define I2S_SYNCBUSY_DATA_Msk (_UINT16_(0x3) << I2S_SYNCBUSY_DATA_Pos) /* (I2S_SYNCBUSY Mask) DATA */
#define I2S_SYNCBUSY_DATA(value) (I2S_SYNCBUSY_DATA_Msk & (_UINT16_(value) << I2S_SYNCBUSY_DATA_Pos))

/* -------- I2S_SERCTRL : (I2S Offset: 0x20) (R/W 32) Serializer n Control -------- */
#define I2S_SERCTRL_RESETVALUE _UINT32_(0x00) /*  (I2S_SERCTRL) Serializer n Control  Reset Value */

