ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/i2s.h
        (I2S_SERCTRL_SLOTDIS6_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << I2S_SERCTRL_SLOTDIS6_Pos)) /* Assigment of value for SLOTDIS6 in the I2S_SERCTRL register */
#define I2S_SERCTRL_SLOTDIS7_Pos _UINT32_(23) /* (I2S_SERCTRL) Slot 7 Disabled for this Serializer Position */
#define I2S_SERCTRL_SLOTDIS7_Msk                                                                                       \
        (_UINT32_(0x1) << I2S_SERCTRL_SLOTDIS7_Pos) /* (I2S_SERCTRL) Slot 7 Disabled for this Serializer Mask */
#define I2S_SERCTRL_SLOTDIS7(value)                                                                                    \
        (I2S_SERCTRL_SLOTDIS7_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << I2S_SERCTRL_SLOTDIS7_Pos)) /* Assigment of value for SLOTDIS7 in the I2S_SERCTRL register */
#define I2S_SERCTRL_MONO_Pos _UINT32_(24) /* (I2S_SERCTRL) Mono Mode Position */
#define I2S_SERCTRL_MONO_Msk (_UINT32_(0x1) << I2S_SERCTRL_MONO_Pos) /* (I2S_SERCTRL) Mono Mode Mask */
#define I2S_SERCTRL_MONO(value)                                                                                        \
        (I2S_SERCTRL_MONO_Msk &                                                                                        \
         (_UINT32_(value) << I2S_SERCTRL_MONO_Pos)) /* Assigment of value for MONO in the I2S_SERCTRL register */
#define I2S_SERCTRL_MONO_STEREO_Val _UINT32_(0x0) /* (I2S_SERCTRL) Normal mode  */
#define I2S_SERCTRL_MONO_MONO_Val _UINT32_(0x1) /* (I2S_SERCTRL) Left channel data is duplicated to right channel  */
#define I2S_SERCTRL_MONO_STEREO                                                                                        \
        (I2S_SERCTRL_MONO_STEREO_Val << I2S_SERCTRL_MONO_Pos) /* (I2S_SERCTRL) Normal mode Position  */
#define I2S_SERCTRL_MONO_MONO                                                                                          \
        (                                                                                                              \
                I2S_SERCTRL_MONO_MONO_Val                                                                              \
                << I2S_SERCTRL_MONO_Pos) /* (I2S_SERCTRL) Left channel data is duplicated to right channel Position */
#define I2S_SERCTRL_DMA_Pos _UINT32_(25) /* (I2S_SERCTRL) Single or Multiple DMA Channels Position */
#define I2S_SERCTRL_DMA_Msk                                                                                            \
        (_UINT32_(0x1) << I2S_SERCTRL_DMA_Pos) /* (I2S_SERCTRL) Single or Multiple DMA Channels Mask */
#define I2S_SERCTRL_DMA(value)                                                                                         \
        (I2S_SERCTRL_DMA_Msk &                                                                                         \
         (_UINT32_(value) << I2S_SERCTRL_DMA_Pos)) /* Assigment of value for DMA in the I2S_SERCTRL register */
#define I2S_SERCTRL_DMA_SINGLE_Val _UINT32_(0x0) /* (I2S_SERCTRL) Single DMA channel  */
#define I2S_SERCTRL_DMA_MULTIPLE_Val _UINT32_(0x1) /* (I2S_SERCTRL) One DMA channel per data channel  */
#define I2S_SERCTRL_DMA_SINGLE                                                                                         \
        (I2S_SERCTRL_DMA_SINGLE_Val << I2S_SERCTRL_DMA_Pos) /* (I2S_SERCTRL) Single DMA channel Position  */
#define I2S_SERCTRL_DMA_MULTIPLE                                                                                       \
        (                                                                                                              \
                I2S_SERCTRL_DMA_MULTIPLE_Val                                                                           \
                << I2S_SERCTRL_DMA_Pos) /* (I2S_SERCTRL) One DMA channel per data channel Position  */
#define I2S_SERCTRL_RXLOOP_Pos _UINT32_(26) /* (I2S_SERCTRL) Loop-back Test Mode Position */
#define I2S_SERCTRL_RXLOOP_Msk (_UINT32_(0x1) << I2S_SERCTRL_RXLOOP_Pos) /* (I2S_SERCTRL) Loop-back Test Mode Mask */
#define I2S_SERCTRL_RXLOOP(value)                                                                                      \
        (I2S_SERCTRL_RXLOOP_Msk &                                                                                      \
         (_UINT32_(value) << I2S_SERCTRL_RXLOOP_Pos)) /* Assigment of value for RXLOOP in the I2S_SERCTRL register */
#define I2S_SERCTRL_Msk _UINT32_(0x07FFF7BF) /* (I2S_SERCTRL) Register Mask  */

#define I2S_SERCTRL_SLOTDIS_Pos _UINT32_(16) /* (I2S_SERCTRL Position) Slot x Disabled for this Serializer */
#define I2S_SERCTRL_SLOTDIS_Msk (_UINT32_(0xFF) << I2S_SERCTRL_SLOTDIS_Pos) /* (I2S_SERCTRL Mask) SLOTDIS */
#define I2S_SERCTRL_SLOTDIS(value) (I2S_SERCTRL_SLOTDIS_Msk & (_UINT32_(value) << I2S_SERCTRL_SLOTDIS_Pos))

/* -------- I2S_DATA : (I2S Offset: 0x30) (R/W 32) Data n -------- */
#define I2S_DATA_RESETVALUE _UINT32_(0x00) /*  (I2S_DATA) Data n  Reset Value */

#define I2S_DATA_DATA_Pos _UINT32_(0) /* (I2S_DATA) Sample Data Position */
#define I2S_DATA_DATA_Msk (_UINT32_(0xFFFFFFFF) << I2S_DATA_DATA_Pos) /* (I2S_DATA) Sample Data Mask */
#define I2S_DATA_DATA(value)                                                                                           \
        (I2S_DATA_DATA_Msk &                                                                                           \
         (_UINT32_(value) << I2S_DATA_DATA_Pos)) /* Assigment of value for DATA in the I2S_DATA register */
#define I2S_DATA_Msk _UINT32_(0xFFFFFFFF) /* (I2S_DATA) Register Mask  */


/** \brief I2S register offsets definitions */
#define I2S_CTRLA_REG_OFST _UINT32_(0x00) /* (I2S_CTRLA) Control A Offset */
#define I2S_CLKCTRL_REG_OFST _UINT32_(0x04) /* (I2S_CLKCTRL) Clock Unit n Control Offset */
#define I2S_CLKCTRL0_REG_OFST _UINT32_(0x04) /* (I2S_CLKCTRL0) Clock Unit n Control Offset */
#define I2S_CLKCTRL1_REG_OFST _UINT32_(0x08) /* (I2S_CLKCTRL1) Clock Unit n Control Offset */
#define I2S_INTENCLR_REG_OFST _UINT32_(0x0C) /* (I2S_INTENCLR) Interrupt Enable Clear Offset */
#define I2S_INTENSET_REG_OFST _UINT32_(0x10) /* (I2S_INTENSET) Interrupt Enable Set Offset */
#define I2S_INTFLAG_REG_OFST _UINT32_(0x14) /* (I2S_INTFLAG) Interrupt Flag Status and Clear Offset */
#define I2S_SYNCBUSY_REG_OFST _UINT32_(0x18) /* (I2S_SYNCBUSY) Synchronization Status Offset */
#define I2S_SERCTRL_REG_OFST _UINT32_(0x20) /* (I2S_SERCTRL) Serializer n Control Offset */
#define I2S_SERCTRL0_REG_OFST _UINT32_(0x20) /* (I2S_SERCTRL0) Serializer n Control Offset */
#define I2S_SERCTRL1_REG_OFST _UINT32_(0x24) /* (I2S_SERCTRL1) Serializer n Control Offset */
#define I2S_DATA_REG_OFST _UINT32_(0x30) /* (I2S_DATA) Data n Offset */
#define I2S_DATA0_REG_OFST _UINT32_(0x30) /* (I2S_DATA0) Data n Offset */
#define I2S_DATA1_REG_OFST _UINT32_(0x34) /* (I2S_DATA1) Data n Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief I2S register API structure */
typedef struct { /* Inter-IC Sound Interface */
        __IO uint8_t I2S_CTRLA; /**< Offset: 0x00 (R/W  8) Control A */
        __I uint8_t Reserved1[0x03];
        __IO uint32_t I2S_CLKCTRL[2]; /**< Offset: 0x04 (R/W  32) Clock Unit n Control */
        __IO uint16_t I2S_INTENCLR; /**< Offset: 0x0C (R/W  16) Interrupt Enable Clear */
        __I uint8_t Reserved2[0x02];
        __IO uint16_t I2S_INTENSET; /**< Offset: 0x10 (R/W  16) Interrupt Enable Set */
        __I uint8_t Reserved3[0x02];
        __IO uint16_t I2S_INTFLAG; /**< Offset: 0x14 (R/W  16) Interrupt Flag Status and Clear */
        __I uint8_t Reserved4[0x02];
        __I uint16_t I2S_SYNCBUSY; /**< Offset: 0x18 (R/   16) Synchronization Status */
        __I uint8_t Reserved5[0x06];
        __IO uint32_t I2S_SERCTRL[2]; /**< Offset: 0x20 (R/W  32) Serializer n Control */
        __I uint8_t Reserved6[0x08];
        __IO uint32_t I2S_DATA[2]; /**< Offset: 0x30 (R/W  32) Data n */
} i2s_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_I2S_COMPONENT_H_ */
